app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-09-12 00:11:14.824913"], ["updated_at", "2019-09-12 00:11:14.824913"]]
---
  def create
    @student = Student.create(set_params(:first_name, :last_name))

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-09-12 02:27:08.024876"], ["id", 1]]
---
  def update
    set_student
    @student.update(set_params(:first_name, :last_name))